#### Terraform Validation & Plan Results
* Terraform Version 📎`1.10.4`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].time_rotating.rotating_current: Refreshing state... [id=2025-01-16T10:55:10Z][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_developer[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_reader[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_admin: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_network_connectivity_config.network_connectivity_config: Refreshing state... [id=515f13c1-53bb-48fb-a2c9-75e3f5d943f5/1c19cc09-0b2b-47d9-a7d6-91afd29efae4][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_admin: Read complete after 2s [id=408985471222074][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_reader[0]: Read complete after 2s [id=439960392122911][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_developer[0]: Read complete after 2s [id=66271379238954][0m
[0m[1mmodule.data_landing_zone.module.core.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_engineering: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_consumption: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_resource_group.resource_group_app: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_resource_group.resource_group_app_monitoring: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg][0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_storage: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg][0m
[0m[1mmodule.data_landing_zone.module.core.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_subscription.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fr"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fr"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_location.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_access_connector_consumption.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-core-int-cnsmptn-dbac001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_subscription.current: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.databricks_access_connector.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-dptest-prd-dbac001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_access_connector_engineering.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-core-int-eng-dbac001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_monitor_action_group.monitor_action_group: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Insights/actionGroups/mydlz01-dptest-prd-ag001][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_consumption_budget_subscription.consumption_budget_subscription: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Consumption/budgets/mydlz01-dptest-prd-bdgt][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_route_table.route_table: Read complete after 2s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal_databricks: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.azuread_service_principal.service_principal: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_location.current: Read complete after 2s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/locations/northeurope][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_developer[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal_databricks: Read complete after 1s [id=/servicePrincipals/7f7c7b4a-704d-4531-b73e-45e16b388271][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_admin: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.azuread_service_principal.service_principal: Read complete after 1s [id=/servicePrincipals/e73816f4-d36e-4271-8f9b-ad2752bdbfaf][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_reader[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal: Read complete after 1s [id=/servicePrincipals/e73816f4-d36e-4271-8f9b-ad2752bdbfaf][0m
[0m[1mmodule.data_landing_zone.module.platform.azapi_update_resource.virtual_network: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_developer[0]: Read complete after 2s [id=/groups/fd3a6a34-8e7c-4315-803a-eedba0cc4b83][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_monitor_activity_log_alert.monitor_activity_log_alert_service_health: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Insights/activityLogAlerts/mydlz01-dptest-prd-alert-servicehealth][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/89bb815f-6e27-51c6-dc68-a299adb595b1][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_admin: Read complete after 1s [id=/groups/f3776135-9227-43a1-a4bd-b786a82878fc][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_service_principal.service_principal: Refreshing state... [id=8089508589893950][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_cognitive_services_usages_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Authorization/roleAssignments/181b7795-1ecc-99bd-4a70-60427e22621e][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/7f2bdca7-7567-7dce-c1f3-b99c927f1a5a][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_reader[0]: Read complete after 2s [id=/groups/46a9f467-c63d-4a24-8de9-bb148135bec5][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/7bc301a5-9b73-924c-2c8f-b3cfece7be24][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/48a17da7-8fe9-504c-24ae-bbe36ba4eb4a][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/ebb6008d-43df-c1e9-677c-f73327f1cef0][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.databricksresourceprovider_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/4c3f0be9-c17a-00b6-10fb-2adbc30daa2d][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_officer_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/ccad6cad-e0e7-8efa-77ee-b1566303d899][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_user_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/d2ac2875-e385-02a1-0deb-6b9c79b429cf][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/75b0cc6b-f1eb-a7de-7055-08ea0ccd9d83][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_cognitive_services_usages_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Authorization/roleAssignments/89efae24-e10b-86a9-09d4-e8aa28d7043d][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/1e4c7608-f492-0e80-8184-18b798091325][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_officer_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/3e6e836f-b6f0-8453-9e0f-954ff5fd8e70][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/c83d6d0e-a45f-9e2f-146b-5f4eb812ba2b][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/a1bf4a2f-04a8-9451-e21a-2c89172f3178][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/providers/Microsoft.Authorization/roleAssignments/605ab883-0b84-4d5f-7375-65feebc5005c][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/providers/Microsoft.Authorization/roleAssignments/efa8935a-da64-1691-2332-16f8d0b80d5a][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/providers/Microsoft.Authorization/roleAssignments/d1494fa3-5837-d9c9-a007-94be9c2b54bf][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/providers/Microsoft.Authorization/roleAssignments/60331577-4a6e-2971-ac2a-e9d8bacf62d9][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/providers/Microsoft.Authorization/roleAssignments/07a23a32-c01f-f4ef-0f43-9634b91e13bd][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/42e67229-c5c6-a48c-e358-d1107659fb8e][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_external: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_curated: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_workspace_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/providers/Microsoft.Authorization/roleAssignments/ac548e90-1b8c-194d-2275-6e841f59e356][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_curated_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/providers/Microsoft.Authorization/roleAssignments/9cc772c4-fcc1-ad4f-ea35-c85ad753bd37][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/e738be5e-a847-f6f8-5657-56c92ca040ca][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_enriched: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_raw: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/869c984c-b547-c606-308a-a7fe5605036b][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_external_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/providers/Microsoft.Authorization/roleAssignments/d4ad7e48-c844-5fb9-690a-2cecea2387af][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_enriched_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/providers/Microsoft.Authorization/roleAssignments/10131aeb-ff1e-f648-1a80-f41369163788][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_raw_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/providers/Microsoft.Authorization/roleAssignments/ad026ea6-058a-ae4d-846c-5e47d01271a1][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/fa5f0f37-a340-53a9-f6a2-20df64d36374][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dptest-prd-kv001-vault-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgext-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgext-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgcur-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgcur-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgenr-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgenr-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgraw-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgraw-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-enriched-dfs"]: Refreshing state... [id=1c19cc09-0b2b-47d9-a7d6-91afd29efae4/7b7ccd2f-164a-42ba-a326-7d5f71122016][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-workspace-dfs"]: Refreshing state... [id=1c19cc09-0b2b-47d9-a7d6-91afd29efae4/015c2568-995d-494b-a8ed-a9fc02e7b9cf][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-external-blob"]: Refreshing state... [id=1c19cc09-0b2b-47d9-a7d6-91afd29efae4/1eb81460-77c3-4406-8e34-063dfc9e5eea][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-raw-blob"]: Refreshing state... [id=1c19cc09-0b2b-47d9-a7d6-91afd29efae4/b55cfa17-2cfc-4d4a-847f-2ea904d41764][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-external-dfs"]: Refreshing state... [id=1c19cc09-0b2b-47d9-a7d6-91afd29efae4/e5dec623-e48d-4f88-a78e-364b7033dbae][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-enriched-blob"]: Refreshing state... [id=1c19cc09-0b2b-47d9-a7d6-91afd29efae4/bd6169a1-4f3b-4c24-b9bd-cc573b95255a][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-curated-blob"]: Refreshing state... [id=1c19cc09-0b2b-47d9-a7d6-91afd29efae4/8384ade9-20b9-4da2-bd9a-885b5a005a08][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-workspace-blob"]: Refreshing state... [id=1c19cc09-0b2b-47d9-a7d6-91afd29efae4/a900fe3d-426f-47eb-b49a-56a1c8b5b57e][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-curated-dfs"]: Refreshing state... [id=1c19cc09-0b2b-47d9-a7d6-91afd29efae4/40b0b7b0-5b69-4011-bead-d0a90537be60][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-raw-dfs"]: Refreshing state... [id=1c19cc09-0b2b-47d9-a7d6-91afd29efae4/32c03c21-e63f-437f-a23f-11dd51012b04][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgwks-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgwks-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/78428e0c-5c1a-0e14-5797-53635b091989][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/e0de91f9-3cf6-df43-3493-d66791d69543][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/9c5f10c5-abe0-5759-4d30-1ee8a1304215][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/e60b7804-cee1-1a03-4c17-de547d9d6a07][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_external_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/a81df05b-af37-f265-c32c-f32b1ed7a9d1][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/6ccc0526-592f-481c-3a59-a68ed7e25fd1][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/b86072b6-9e27-20d9-3804-65e6ce2d1834][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/f2dbd775-32e3-28c0-11ab-7f211b0e8cc9][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_curated_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/e0749b64-5fc5-dcad-e618-012084e8042c][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/3899f752-ec33-31c3-98a2-413bcc1d6169][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/b6ac4e85-979b-a4b3-af7c-6de2e963d63d][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/6a40f957-1ab4-aa6b-90f8-0c2f3890465b][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/c5b0e384-0f48-78ca-8ae2-693583b6ef58][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_enriched_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/c0400ef6-8248-2848-15e9-a25a380aee47][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/2e3ebaf4-289f-e6c6-2365-162e4c178444][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_raw_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/78d86598-808a-04e7-bd17-69a95485ccd8][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/83abadbc-07db-0002-9059-b77ff92c879d][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/b23984c3-ec7b-a5af-646c-4e149277594a][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/aaf83e73-b239-cc2d-fe4c-8256a86ef934][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/6ed43e4c-7503-64d1-d34e-aeca92fa0687][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-cnsmptn-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_workspace_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/1d43b97e-39c0-2b30-3ade-4e1f56eb23ab][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/5f6cf8c7-a27a-0c91-3c2b-c808f9642bab][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/b9029f56-8dd3-8f0c-a227-8ecce0f22339][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/486335b3-7f25-7c76-8776-fc67e0ae6e1d][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/47eee392-58c8-b004-abba-701f024b0bee][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-16T10:58:19Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-16T11:00:40Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-external-dfs"]: Refreshing state... [id=922607957873695149][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-workspace-blob"]: Refreshing state... [id=2899155867064763418][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-raw-blob"]: Refreshing state... [id=5447669551422997474][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-external-blob"]: Refreshing state... [id=1106858246281154423][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-curated-dfs"]: Refreshing state... [id=5518524791822450727][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-raw-dfs"]: Refreshing state... [id=5224997974880681685][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-enriched-dfs"]: Refreshing state... [id=586702671132619720][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-workspace-dfs"]: Refreshing state... [id=5953131983039890070][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-curated-blob"]: Refreshing state... [id=7327708125893916459][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-enriched-blob"]: Refreshing state... [id=6836411799882264888][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-16T10:58:38Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-16T10:58:33Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-16T10:58:30Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-16T10:59:35Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-cnsmptn-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-16T11:02:31Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-16T11:02:21Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/d08758e2-b4dc-c663-c44f-cfb3fc7c6bd2][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/3aa783f6-678b-5991-5dc7-bebdff620fd0][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/0a7ffbd8-53f0-b6bc-44e7-87cf08426884][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/49070bc0-56d5-0e18-7435-4179ba9c6cd3][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_binding.ncc_binding["consumption"]: Refreshing state... [id=1245096076002105/1c19cc09-0b2b-47d9-a7d6-91afd29efae4][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_budget.budget[0]: Refreshing state... [id=515f13c1-53bb-48fb-a2c9-75e3f5d943f5|bd6658da-fa20-4d6f-bbf2-ddbf5f717f1b][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_binding.ncc_binding["engineering"]: Refreshing state... [id=866574492334959/1c19cc09-0b2b-47d9-a7d6-91afd29efae4][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_directory.directory: Refreshing state... [id=/mydlz01-dptest-int][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["storage"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|storage][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["billing"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|billing][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permission_assignment.permission_assignment_service_principal: Refreshing state... [id=8089508589893950][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["serving"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|serving][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["compute"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|compute][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["query"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|query][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["lakeflow"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|lakeflow][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["access"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|access][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["marketplace"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|marketplace][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permission_assignment.permission_assignment_developer[0]: Refreshing state... [id=66271379238954][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permission_assignment.permission_assignment_reader[0]: Refreshing state... [id=439960392122911][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permission_assignment.permission_assignment_admin: Refreshing state... [id=408985471222074][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_cluster_policy.cluster_policy["JobComputePolicyPtt"]: Refreshing state... [id=00017C5AA902E049][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_cluster_policy.cluster_policy["PersonalComputePolicyPtt"]: Refreshing state... [id=000A03E16413BCEA][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_workspace_conf.workspace_conf: Refreshing state... [id=_][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_cluster_policy.cluster_policy["DltComputePolicyPtt"]: Refreshing state... [id=00178B7D722A2FDF][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permissions.permissions_cluster_policy["JobComputePolicyPtt"]: Refreshing state... [id=/cluster-policies/00017C5AA902E049][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permissions.permissions_cluster_policy["DltComputePolicyPtt"]: Refreshing state... [id=/cluster-policies/00178B7D722A2FDF][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permissions.permissions_cluster_policy["PersonalComputePolicyPtt"]: Refreshing state... [id=/cluster-policies/000A03E16413BCEA][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permissions.permissions_directory: Refreshing state... [id=/directories/3093692112650812][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_admin["fr"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "role_assignment_ai_service_admin" {
      [32m+[0m[0m condition_version                = (known after apply)
      [32m+[0m[0m description                      = "Role assignment to the ai services."
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "f3776135-9227-43a1-a4bd-b786a82878fc"
      [32m+[0m[0m principal_type                   = "Group"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Cognitive Services User"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_developer["fr"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "role_assignment_ai_service_developer" {
      [32m+[0m[0m condition_version                = (known after apply)
      [32m+[0m[0m description                      = "Role assignment to the ai services."
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "fd3a6a34-8e7c-4315-803a-eedba0cc4b83"
      [32m+[0m[0m principal_type                   = "Group"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Cognitive Services User"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_service_principal["fr"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "role_assignment_ai_service_service_principal" {
      [32m+[0m[0m condition_version                = (known after apply)
      [32m+[0m[0m description                      = "Role assignment to the ai services."
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "e73816f4-d36e-4271-8f9b-ad2752bdbfaf"
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Cognitive Services User"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_catalog.catalog_external[0m will be created
[0m  [32m+[0m[0m resource "databricks_catalog" "catalog_external" {
      [32m+[0m[0m comment                        = "Data Applicaton Catalog - dptest - External"
      [32m+[0m[0m enable_predictive_optimization = "DISABLE"
      [32m+[0m[0m force_destroy                  = true
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m isolation_mode                 = "OPEN"
      [32m+[0m[0m metastore_id                   = (known after apply)
      [32m+[0m[0m name                           = "mydlz01-dptest-int"
      [32m+[0m[0m owner                          = (known after apply)
      [32m+[0m[0m properties                     = {
          [32m+[0m[0m "app_name"    = "dptest"
          [32m+[0m[0m "costCenter"  = "ABCD1234"
          [32m+[0m[0m "environment" = "int"
          [32m+[0m[0m "location"    = "northeurope"
          [32m+[0m[0m "use"         = "external"
        }
      [32m+[0m[0m storage_root                   = "abfss://mydlz01-dptest-prd-cur@mydlz01coreintstgcur.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_catalog.catalog_internal[0m will be created
[0m  [32m+[0m[0m resource "databricks_catalog" "catalog_internal" {
      [32m+[0m[0m comment                        = "Data Applicaton Catalog - dptest - Internal"
      [32m+[0m[0m enable_predictive_optimization = "DISABLE"
      [32m+[0m[0m force_destroy                  = true
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m isolation_mode                 = "ISOLATED"
      [32m+[0m[0m metastore_id                   = (known after apply)
      [32m+[0m[0m name                           = "mydlz01-dptest-int-int"
      [32m+[0m[0m owner                          = (known after apply)
      [32m+[0m[0m properties                     = {
          [32m+[0m[0m "app_name"    = "dptest"
          [32m+[0m[0m "costCenter"  = "ABCD1234"
          [32m+[0m[0m "environment" = "int"
          [32m+[0m[0m "location"    = "northeurope"
          [32m+[0m[0m "use"         = "internal"
        }
      [32m+[0m[0m storage_root                   = "abfss://mydlz01-dptest-prd-cur@mydlz01coreintstgcur.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_curated[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_curated" {
      [32m+[0m[0m comment         = "Default curated storage layer for 'dptest' data application."
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-cur"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-cur@mydlz01coreintstgcur.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_enriched[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_enriched" {
      [32m+[0m[0m comment         = "Default enriched storage layer for 'dptest' data application."
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-enr"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-enr@mydlz01coreintstgenr.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_external[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_external" {
      [32m+[0m[0m comment         = "Default external storage layer for 'dptest' data application."
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-ext"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-ext@mydlz01coreintstgext.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_raw[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_raw" {
      [32m+[0m[0m comment         = "Default raw storage layer for 'dptest' data application."
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-raw"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-raw@mydlz01coreintstgraw.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_workspace[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_workspace" {
      [32m+[0m[0m comment         = "Default workspace storage layer for 'dptest' data application."
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-wks"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-wks@mydlz01coreintstgwks.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_external_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_admin" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-admin"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_external_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_developer" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-developer"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_external_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_reader" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-reader"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_external_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_service_principal" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_internal_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_admin" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-admin"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_internal_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_developer" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-developer"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_internal_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_reader" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-reader"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_internal_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_service_principal" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_curated_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_curated_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_curated_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_curated_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_enriched_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_enriched_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_enriched_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_enriched_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_external_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_external_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_external_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_external_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_raw_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_raw_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_raw_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_raw_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_workspace_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_workspace_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_workspace_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_workspace_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_storage_credential_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_storage_credential_admin" {
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m principal          = "app001-admin"
      [32m+[0m[0m privileges         = [
          [32m+[0m[0m "CREATE EXTERNAL LOCATION",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
      [32m+[0m[0m storage_credential = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_storage_credential_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_storage_credential_developer" {
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m principal          = "app001-developer"
      [32m+[0m[0m privileges         = [
          [32m+[0m[0m "CREATE EXTERNAL LOCATION",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
      [32m+[0m[0m storage_credential = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_storage_credential_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_storage_credential_reader" {
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m principal          = "app001-reader"
      [32m+[0m[0m privileges         = [
          [32m+[0m[0m "READ_FILES",
        ]
      [32m+[0m[0m storage_credential = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_storage_credential_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_storage_credential_service_principal" {
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m principal          = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges         = [
          [32m+[0m[0m "CREATE EXTERNAL LOCATION",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
      [32m+[0m[0m storage_credential = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_secret_acl.secret_acl_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_secret_acl" "secret_acl_admin" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m permission = "READ"
      [32m+[0m[0m principal  = "app001-admin"
      [32m+[0m[0m scope      = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_secret_acl.secret_acl_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_secret_acl" "secret_acl_developer" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m permission = "READ"
      [32m+[0m[0m principal  = "app001-developer"
      [32m+[0m[0m scope      = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_secret_acl.secret_acl_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_secret_acl" "secret_acl_service_principal" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m permission = "READ"
      [32m+[0m[0m principal  = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m scope      = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_secret_scope.secret_scope[0m will be created
[0m  [32m+[0m[0m resource "databricks_secret_scope" "secret_scope" {
      [32m+[0m[0m backend_type = "AZURE_KEYVAULT"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m name         = "mydlz01-dptest-int-secret-scope"

      [32m+[0m[0m keyvault_metadata {
          [32m+[0m[0m dns_name    = "https://mydlz01-dptest-prd-kv001.vault.azure.net/"
          [32m+[0m[0m resource_id = "/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001"
        }
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_storage_credential.storage_credential[0m will be created
[0m  [32m+[0m[0m resource "databricks_storage_credential" "storage_credential" {
      [32m+[0m[0m comment               = "Managed identity credential for 'dptest' Data Product"
      [32m+[0m[0m force_destroy         = true
      [32m+[0m[0m force_update          = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m isolation_mode        = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id          = (known after apply)
      [32m+[0m[0m name                  = "mydlz01-dptest-int-cred"
      [32m+[0m[0m owner                 = (known after apply)
      [32m+[0m[0m read_only             = false
      [32m+[0m[0m skip_validation       = false
      [32m+[0m[0m storage_credential_id = (known after apply)

      [32m+[0m[0m azure_managed_identity {
          [32m+[0m[0m access_connector_id = "/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-dptest-prd-dbac001"
          [32m+[0m[0m credential_id       = (known after apply)
        }

      [32m+[0m[0m databricks_gcp_service_account (known after apply)
    }

[1m  # module.data_landing_zone.module.data_application["dptest"].module.ai_service["fr"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_cognitive_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_application["dptest"].module.ai_service["fr"].azurerm_cognitive_account.cognitive_account[0m will be created
[0m  [32m+[0m[0m resource "azurerm_cognitive_account" "cognitive_account" {
      [32m+[0m[0m custom_subdomain_name              = "mydlz01-dptest-prd-fr-kv001"
      [32m+[0m[0m dynamic_throttling_enabled         = false
      [32m+[0m[0m endpoint                           = (known after apply)
      [32m+[0m[0m fqdns                              = []
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m kind                               = "FormRecognizer"
      [32m+[0m[0m local_auth_enabled                 = false
      [32m+[0m[0m location                           = "northeurope"
      [32m+[0m[0m name                               = "mydlz01-dptest-prd-fr-kv001"
      [32m+[0m[0m outbound_network_access_restricted = true
      [32m+[0m[0m primary_access_key                 = (sensitive value)
      [32m+[0m[0m public_network_access_enabled      = false
      [32m+[0m[0m resource_group_name                = "mydlz01-dptest-prd-rg"
      [32m+[0m[0m secondary_access_key               = (sensitive value)
      [32m+[0m[0m sku_name                           = "S0"
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "costCenter" = "ABCD1234"
        }

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m network_acls {
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # module.data_landing_zone.module.data_application["dptest"].module.ai_service["fr"].azurerm_private_endpoint.private_endpoint_cognitive_account[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydlz01-dptest-prd-fr-kv001-account-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydlz01-dptest-prd-fr-kv001-account-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydlz01-dptest-prd-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/PrivateEndpointSubnet-dptest"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "costCenter" = "ABCD1234"
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydlz01-dptest-prd-fr-kv001-account-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "account",
            ]
        }
    }

[1m  # module.data_landing_zone.module.data_application["dptest"].module.ai_service["fr"].time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "20s"
      [32m+[0m[0m id              = (known after apply)
    }

[1mPlan:[0m 50 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>